{
    "about": " I am a robotics engineer specializing in autonomy, perception, and field robotics, with hands-on experience developing real-world autonomous systems for agricultural and industrial applications. \nMost recently, I worked as a Robotics Engineer Intern at Bonsai Robotics, where I contributed to the development and improvement of the data collection pipeline for the company’s AMIGA robot series. My work focused on ensuring high-quality, structured field data to support perception and research teams. I also contributed to the development and testing of next-generation autonomy software running on NVIDIA Jetson–based systems, enabling robust autonomous operation in challenging agricultural environments. \nPreviously, I served as a Robotics Engineer in Prof. Sunoj Shajahan’s Digital Precision Agriculture Lab at the University of Illinois Urbana-Champaign. There, I designed and integrated key autonomy components including vision-based navigation, safety systems, and an autonomous vision-guided mechanical weeding system, all deployed and validated on the AMIGA platform for real-world field use. Earlier in my career, I worked as a Robotic R&D Intern at Rucha Yantra LLP, gaining hands-on experience with Autonomous Guided Vehicles (AGVs) and vision-based automation systems. My responsibilities spanned computer vision, navigation, and control, with deployments on hardware such as Raspberry Pi, NVIDIA Jetson, and diverse sensor suites. \nI hold a Master’s degree in Autonomy & Robotics from UIUC (Dec 2024) and a Bachelor’s degree in Computer Science and Engineering from Shri Ramdeobaba College of Engineering and Management. I have been actively involved in robotics competitions and technical clubs, earning third place in the NASA Space Settlement Contest and first place in multiple drone competitions. \nI am currently seeking full-time opportunities in robotics and autonomous systems, where I can apply my experience in perception, autonomy, and field robotics to build intelligent, reliable robots that operate in complex real-world environments.",
    "imageSource": "images/about/profile.png"
    
}
