{
    "about": " I am a Robotics Engineer Intern at Bonsai Robotics, where I work on developing and improving the data collection pipeline for the company’s AMIGA robot series. My work ensures that high-quality, structured field data is captured to support multiple teams, including perception and research. I also contribute to the development and testing of new autonomy software for the NVIDIA Jetson–based brain that powers the next generation of AMIGA robots, enabling robust autonomous operation in agricultural environments. Previously, I worked as a Robotics Engineer at Prof. Sunoj Shajahan’s Digital Precision Agriculture Lab, at the University of Illinois Urbana-Champaign, where I developed and integrated key components such as vision-based autonomous navigation, safety systems, and an autonomous vision-guided mechanical weeding system. These systems were designed and optimized on the AMIGA platform for real-world agricultural applications. Earlier in my career, I served as a Robotic R&D Intern at Rucha Yantra LLP, gaining hands-on experience with Autonomous Guided Vehicles (AGVs) and vision-based automation projects. My responsibilities included developing algorithms for computer vision, navigation, and control, and deploying them on hardware such as Raspberry Pi, NVIDIA Jetson, and a variety of sensors. I hold a Master’s in Autonomy & Robotics from the University of Illinois Urbana-Champaign (Dec ’24) and a B.E. in Computer Science and Engineering from Shri Ramdeobaba College of Engineering and Management, where I was actively involved in robotics and technical clubs. I also earned third place in the NASA Space Settlement Contest (2014) and first place in drone competitions. Currently, I am seeking full-time opportunities in robotics and autonomy, where I can apply my experience in robot perception, field robotics, and autonomous systems to build intelligent solutions that push the boundaries of agricultural and industrial automation. ",
    "imageSource": "images/about/profile.png"
    
}
