{
    "experiences": [
        {
            "title": "Robotics Engineer",
            "subtitle": "Bonsai Robotics",
            "workType": "Internship",
            "workDescription": [
                "Working on the end-to-end data collection infrastructure for Bonsai Robotics’ AMIGA robots — enabling high-quality, structured, and scalable data capture to support perception, autonomy, and research pipelines.",
                "Collaborating with cross-functional teams to define data requirements, design collection protocols, and participate in field testing to ensure the data meets real-world performance and quality standards.",
                "Contributing to the integration, development, and testing of next-generation autonomy software on the NVIDIA Jetson-based platform, enhancing on-field decision-making and autonomous navigation capabilities."
            ],
            "dateText": "Oct 2025 - Current",
            "icon" : {
                "src": "images/experience/BonsaiRobotics.png",
                "class": "experience-icon"
            }
        },
        {
            "title": "Robotics Engineer",
            "subtitle": "Prof. Sunoj Shajahan, UIUC",
            "workType": "Full-Time",
            "workDescription": [
                "Leading a team to develop vision-based lane-following navigation and Model Predictive Controller (MPC) systems for the AMIGA platform, utilizing OAK depth cameras to enable seamless autonomous driving and real-time obstacle detection, enhancing operational efficiency.",
                "Designing and developing vision-based autonomous weeding mechanism with ROS 2, integrating Jetson Orin, lead screw actuators, and pneumatic cylinders for precise, automated weed detection and removal in Horseradish farming, driving cost savings and improved crop yields.",
                "Integrating software and hardware together for AMIGA, focusing on algorithm validation, sensor latency, & error handling to optimize performance.",
                "Developing Gazebo simulations to test and fine-tune algorithms in various scenarios, ensuring robust and adaptable solutions for autonomous navigation and weeding.",
                "Collaborating with horseradish farmers to gather valuable feedback on prototype performance, continuously refining the system’s functionality to meet real-world challenges and improve its overall effectiveness."
            ],
            "dateText": "Feb 2025 - Aug 2025",
            "icon" : {
                "src": "images/experience/UIUC.png",
                "class": "experience-icon"
            }
        },
        {
            "title": "Graduate Student Researcher",
            "subtitle": "Prof. Sunoj Shajahan, UIUC",
            "workDescription": [
                "Worked under Prof. John Reid & Prof. Sunoj Shajahan as a Graduate Student developing the autonomous navigation capabilities for the AMIGA robot along with precise mechanical weeding mechanism to autonomously remove weeds in the Horseradish fields."
            ],
            "dateText": "Sept 2024 - Dec 2024",
            "icon" : {
                "src": "images/experience/UIUC.png",
                "class": "experience-icon"
            }
        },
        {
            "title": "Robotics Engineer",
            "subtitle": "Kohler Co.",
            "workType": "Professional Practicum",
            "workDescription": [
                "Explored LiDAR, point clouds, and depth cameras for defect detection, ultimately utilizing Basler machine vision cameras to develop a real-time vision-based inspection system, improving defect identification speed, accuracy, & consistency in Kohler’s manufacturing process.",
                "Implemented computer vision techniques and leveraged GANs to create synthetic datasets for hard-to-detect glaze defects in ceramics, building a proof of concept (PoC) for integrating machine learning models into existing systems, improving quality control and efficiency."
            ],
            "dateText": "Jun 2024 - Aug 2024",
            "icon" : {
                "src": "images/experience/Kohler.png",
                "class": "experience-icon"
            }
        },
        {
            "title": "Research Project",
            "subtitle": "Prof. Katie Driggs Campbell, Human-Centered Autonomy Lab, UIUC",
            "workDescription": [
                "Conducted a series of controlled experiments inspired by the paper ”Towards Robotics that Influence Humans over Long-Term Interaction”, focusing on the application & testing of interaction scenarios using the GEM e4 vehicle.",
                "Implemented pedestrian detection & tracking using YOLO object detection models through the GEMStack technology developed by AutonomouStuff on GEM e4 vehicle."
            ],
            "dateText": "Jun 2024 - July 2024"
        },
        {
            "title": "Robotics R&D Intern",
            "subtitle": "Rucha Yantra LLP",
            "workType": "Internship",
            "workDescription": [
                "Aided in the development of an automated system for high-precision manufacturing, utilizing computer vision to accurately locate critical points on cylindrical units for robotic automation. This initiative helped enhance operational accuracy and safety by reducing human interaction with high-pressure helium gas cylinders.",
                "Collaborated on enhancing autonomous operations by integrating computer vision algorithms that dynamically adjusted robotic mechanisms in real-time, effectively improving production efficiency through reduced processing times.",
                "Contributed to improve the vision based path following for Automated Guided Vehicles (AGV's), automating material handling in warehouse settings and effectively reducing labor demands wile improving workflow efficiancy.",
                "Gained extensive hands-on experience with ROS, Linux, and OpenCV. Collaborated closely with the R&D team to troubleshoot, optimize, and advance the integration of sophisticated sensors and camera systems into industrial automation projects."
            ],
            "dateText": "Dec 2022 - May 2023",
            "icon" : {
                "src": "images/experience/ruchayantra.png",
                "class": "experience-icon"
            }
        },
        {
            "title": "Robotics Intern",
            "subtitle": "Turquoise Automation",
            "workType": "Internship",
            "workDescription": [
                "Developed a robotic prototype, designed to transport heavy materials within warehouse environments to improve operational efficiency and safety.",
                "Worked with sensors and motor controllers integrating them to the robot to facilitate obstacle detection and navigation, supporting effective material handling in dynamic settings.",
                "Utilized ArUco marker detection techniques for pose estimation to enable the robot to ascertain its precise location and orientation within the warehouse.",
                "Implemented control algorithms using Python on platforms like Raspberry Pi and NVIDIA Jetson, which controlled servo motors and motor drivers, enhancing the robot’s navigation and load management abilities."
            ],
            "dateText": "Mar 2022 - Apr 2022",
            "icon" : {
                "src": "images/experience/turquoise.png",
                "class": "experience-icon"
            }
        },
        {
            "title": "Embedded Systems Intern",
            "subtitle": "UFF",
            "workType": "Internship",
            "workDescription": [
                "Led a small team of two in designing and developing a smart portable billing device aimed at improving operational efficiency in restaurants.",
                "Developed a compact billing solution using an ESP32 microcontroller and IoT technologies, featuring a thermal printer for quick receipt issuance. The device incorporated Python-based enhancements to the user interface, supporting robust transaction handling, real-time data synchronization, and remote management capabilities. These improvements facilitated quicker and more accurate transactions in restaurant settings.",
                "The deployment of the smart billing device reduced the reliance on manual order processing, cutting down customer wait times for ordering by over 75% and making the dining experience more efficient."
            ],
            "dateText": "Aug 2020 - Mar 2021",
            "icon" : {
                "src": "images/experience/uff.png",
                "class": "experience-icon"
            }
        }
    ]
}
